{
  "basics": {
    "name": "Thomas Sebastian",
    "label": "Senior Frontend Developer",
    "image": "",
    "email": "thomas.jsm13@gmail.com",
    "phone": "+918867378746",
    "url": "https://github.com/thomsebastin",
    "summary": "Front-end software engineer with 8+ years of experience developing creative and challenging frontend applications. An enthusiastic team player and deep creative thinker. In my free time, I play badminton and enjoy time with family.",
    "location": {
      "address": "7th b main, Classic Paradise Layout",
      "postalCode": "560068",
      "city": "Bengaluru",
      "countryCode": "IN",
      "region": "South India"
    },
    "profiles": [{
      "network": "Github",
      "username": "thomsebastin",
      "url": "https://github.com/thomsebastin"
    }, {
      "network": "Twitter",
      "username": "thomas_0_0",
      "url": "https://twitter.com/thomas_0_0"
    },{
      "network": "Stack Overflow",
      "username": "thomas-sebastian",
      "url": "https://stackoverflow.com/users/3289336/thomas-sebastian"
    },{
      "network": "Linkedin",
      "url": "https://www.linkedin.com/in/thomas-as/"
    }]
  },
  "work": [{
    "name": "Adobe",
    "position": "Senior Frontend Developer",
    "url": "https://adobe.com",
    "startDate": "27-05-2019",
    "endDate": "Present",
    "summary": "Working as a senior consultant at Adobe, I have led and individually contributed to a number of projects for companies like State of Oklahoma, McDonalds, Sears, Techdata, Manulife, United healthcare limited, Alex Forbes etc. Each project comprised small to medium sized developers and stakeholders.",
    "highlights": [
      "Awarded 'Best project of the year 2021 at Adobe' where I was the the UI lead",
      "Built and led a team of 10 high-performing FE Engineers, involved in greening/refinement sessions to capture project requirements. Stepped in as an individual contributor whenever necessary",
      "Created impact by improving page-speed by 30-40% which impacted the overall experience of the end users and there was a significant increase in returning users and overall user count",
      "Accessibility was taken care and captured during the greening phase of the project and this ensured the site was AA compliant and improved the visual and screen reader experience for impaired users.",
      "Worked closely with the design team to bring in a stable design system thereby increasing development speed and predictability. This reduced development hours and scope creep in design saving hundreds of hours."
    ]
  }, {
    "name": "Vimeo",
    "position": "Software Engineer",
    "url": "https://vimeo.com",
    "startDate": "2017",
    "endDate": "2019",
    "summary": "Worked as a Software Frontend Engineer, I was part of the team that built the Vimeo stocks app. I was the individual contributor for many customer-facing high-interaction components like “Add to Album” and “Add to Collection”. Worked on improving the existing design system and implemented a reusable component library that could be leveraged within the company.",
    "highlights": [
      "Built “Add to Album” and animations involved in “Add to collection” feature of the product.",
      "Worked on quality code-reviews and contributed in improving the design system built using React and Storybook that further helped developers in improving their productivity.",
      "Built the Roku app using brightscript and was responsible for building the app from the groudup in a team of just 2 members"
    ]
  }, {
    "name": "Inkoniq",
    "position": "Frontend Developer",
    "url": "https://inkoniq.com",
    "startDate": "2015",
    "endDate": "2017",
    "summary": "Worked as a Frontend developer. I was an individual contributor. I held direct interaction with the customer and delivered different projects to different customers based on their requirements. Here, I worked mainly as a sole FE developer on the projects.",
    "highlights": [
      "I worked as an individual contributor, I worked on projects in AngularJS with extensive API integration. I also worked on many complex projects that involved visual representation of data using charts and 3d rendering using three.js.",
      "Directly interacted with the customer in understanding and gathering the requirements and building the expected features. I undertook the role of guiding other developers by breaking down the tasks for them and setting the right expectations.",
      "Successful go-live of multiple projects without any friction and with utmost customer satisfaction."
    ]
  },  {
    "name": "Wiredelta",
    "position": "Frontend Developer",
    "url": "https://wiredelta.com",
    "startDate": "2014",
    "endDate": "2015"
  }],
  "education": [{
    "institution": "Vishweshwaraya Technological University",
    "url": "https://vtu.ac.in/en/",
    "area": "Computer Science",
    "studyType": "Bachelor",
    "endDate": "06-06-2013"
  }],
  "certificates": [{
    "name": "JavaScript",
    "issuer": "Linkedin",
    "url": "https://www.linkedin.com/skill-assessments/JavaScript/report/"
  }, {
    "name": "CSS",
    "issuer": "Linkedin",
    "url": "https://www.linkedin.com/skill-assessments/Cascading%20Style%20Sheets%20(CSS)/report/"
  }],
  "skills": [{
    "name": "Frontend",
    "level": "Senior",
    "keywords": [
      "HTML",
      "CSS",
      "JavaScript",
      "SASS",
      "Asynchrounous programming",
      "react.js",
      "zustand",
      "redux",
      "jQuery",
      "TypeScript",
      "node.js",
      "webpack",
      "gulp",
      "es-build",
      "API integration",
      "Performance",
      "A11y"
    ]
  }, {
    "name": "JavaScript",
    "level": "Advanced",
    "keywords": []
  }, {
    "name": "CSS",
    "level": "Advanced",
    "keywords": []
  }, {
    "name": "HTML",
    "level": "Advanced",
    "keywords": []
  }, {
    "name": "React.js",
    "level": "intermediate"
  }, {
    "name": "TypeScript",
    "level": "intermediate"
  }, {
    "keywords": ["Node", "Headless"],
    "level": "Beginner",
    "name": "Backend"
  }],
  "languages": [{
    "language": "English",
    "fluency": "Advanced"
  }],
  "interests": [{
    "name": "Badminton"
  }, {
    "name": "Chess"
  }, {
    "name": "Football"
  }],
  "references": [{
    "name": "Aseem Jain",
    "reference": "Thomas was roped in for a quick support in Franklin program. It started with just 30 mins help, but as Thomas is, his strong technical acumen, high commitment, ability to troubleshoot at lightening speed and bring superior value to the table; quickly made him the part of Franklin core team. His support and quick turnaround for Asprey site, brought significant value to the program and the part that GDC ACS played in the larger Franklin charter. Asprey is the first site that went go-live, which was fully developed by GDC. It was also showcased in EMEA Summit and became a huge success. Thomas is highly dependable, reliable, and is a trusted strong team player. He along with the team left no stone unturned, to ensure the success of the site/program. Additionally, with Thomas' picking up Franklin quickly, he had an opportunity to present his learnings and contribute towards Franklin event. As always, Thomas never fails to impress. He not only presented the learnings, but presented in a manner that left a huge impact on the stakeholders and everyone highly appreciated his efforts and contribution. Thomas is a valuable team member and an extremely valuable asset to Adobe."
  }]
}
